In [2]:
# importando biblioteaca
import pandas as pd # pandas agora tem o nome de pd
# ele vai ler o arquivo conforme a seu formato read_nome do formato ex: read_excel,read_html,read_clipboard
# então melhor saber que formato se encontra o arquivo   
# ctrl + c = copia; ctrl + v = cola;                                
df = pd.read_csv(r"C:\Users\user\Desktop\grafico\Athlete\athlete_events.csv") # de ctrl + c no local do arq e cole dentro das aspas
# o r serve para não dar error 
# .head() sem  numero mostra 5 linhas 
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [3]:
#  mas ele pode mostrar a quatidade de linhas que você quiser
df.head(0)
# como você pode ver o titulo esta em ingles, mas tem como mudar isso

Empty DataFrame
Columns: [ID, Name, Sex, Age, Height, Weight, Team, NOC, Games, Year, Season, City, Sport, Event, Medal]
Index: []

In [4]:
#  NOC = Sigla( National Olympic Committee) traduzido = Comitês Olímpicos Nacionais (CON)
 
dif = df.rename(columns={'Name':'Nome','Sex':"Sexo","Age":'Idade','Height':"Peso","Weight":'Altura',"Team":'Time','NOC':"CON","Games":'Jogos',"Year":'Ano','Season':"Temporada","City":'Cidade','Sport':"Esporte",'Event':"Evento","Medal":'Medalha'})
dif.head()

,ID,Nome,Sexo,Idade,Peso,Altura,Time,CON,Jogos,Ano,Temporada,Cidade,Esporte,Evento,Medalha
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [5]:
# e tambem se você quiser te como pegar uma coluna especifaca
altura = df["Weight"].head(10)
altura

# link da kaggle:
# https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results

0    80.0
1    60.0
2     NaN
3     NaN
4    82.0
5    82.0
6    82.0
7    82.0
8    82.0
9    82.0
Name: Weight, dtype: float64

In [17]:
# criando dataframe e dicionario
alunos = {"Nome":["Laura","Lauricio","Marcelo","Mariana","clark Quente","Lex Luter Soares"],
         "Nota":[7, 6, 4.5, 6.9, 8, 11],
          "Media":6.0,
         "Aprovado":["Sim","Sim","Não","Sim","Sim","COMO?!?"]}
print(alunos)

{'Nome': ['Laura', 'Lauricio', 'Marcelo', 'Mariana', 'clark Quente', 'Lex Luter Soares'], 'Nota': [7, 6, 4.5, 6.9, 8, 11], 'Media': 6.0, 'Aprovado': ['Sim', 'Sim', 'Não', 'Sim', 'Sim', 'COMO?!?']}

In [18]:
# como você pode ver se a Nota for menor que 6 ele nao sera aprovado 
df = pd.DataFrame(alunos)
df

               Nome  Nota  Media Aprovado
0             Laura   7.0    6.0      Sim
1          Lauricio   6.0    6.0      Sim
2           Marcelo   4.5    6.0      Não
3           Mariana   6.9    6.0      Sim
4      clark Quente   8.0    6.0      Sim
5  Lex Luter Soares  11.0    6.0  COMO?!?

In [20]:
print(df,"(lex luter na dando infartando os professores)[ainda na escolh]")

               Nome  Nota  Media Aprovado
0             Laura   7.0    6.0      Sim
1          Lauricio   6.0    6.0      Sim
2           Marcelo   4.5    6.0      Não
3           Mariana   6.9    6.0      Sim
4      clark Quente   8.0    6.0      Sim
5  Lex Luter Soares  11.0    6.0  COMO?!? (lex luter na dando infartando os professores)